Repository: pingfangx/TranslatorX-other
Catalog: PEPs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Simpler customisation of class creation
zh_cn: 更简单的类创建定制

source: Simplified Package Layout and Partitioning
zh_cn: 简化的包布局和分区

source: Simplify xrange()
zh_cn: 简化 xrange()

source: Sorting Dictionaries by Value
zh_cn: 按值排序词典

source: Sparse is better than dense.
zh_cn: 稀疏优于密集。

source: Special __main__() function in modules
zh_cn: 模块中特殊的 __main __() 函数

source: Special cases aren't special enough to break the rules.
zh_cn: 特殊情况不足以打破规则。

source: Specifying Minimum Build System Requirements for Python Projects
zh_cn: 指定 Python 项目的最低构建系统要求

source: Stackless Python
zh_cn: 无堆栈的 Python

source: Standard Library Reorganization
zh_cn: 标准库的重组

source: Standard Metadata Extensions for Python Software Packages
zh_cn: Python 软件包的标准元数据扩展

source: Standard daemon process library
zh_cn: 标准守护进程库

source: Standard image protocol and class
zh_cn: 标准的图像协议和类

source: Standard library __preview__ package
zh_cn: 标准库 __preview__ 包

source: Static metadata for Distutils
zh_cn: Distutils 的静态元数据

source: Statically Nested Scopes
zh_cn: 静态嵌套作用域

source: String Interpolation
zh_cn: 字符串插值

source: String Interpolation - Extended Discussion
zh_cn: 字符串插值 - 扩展讨论

source: String representation in Python 3000
zh_cn: Python 3000 中的字符串表示

source: Style Guide for C Code
zh_cn: C 代码样式指南

source: Style Guide for Python Code
zh_cn: Python 代码样式指南

source: Subtyping Built-in Types
zh_cn: 子类型内置类型

source: Support for "wide" Unicode characters
zh_cn: 支持 "宽" Unicode 字符

source: Support for System Upgrades
zh_cn: 支持系统升级

source: Support for indexing with keyword arguments
zh_cn: 支持使用关键字参数进行索引

source: Supporting Non-ASCII Identifiers
zh_cn: 支持非 ASCII 标识符

source: Suppressing exception context
zh_cn: 抑制异常上下文

source: Syntax For Positional-Only Parameters
zh_cn: 仅位置参数的语法

source: Syntax for Delegating to a Subgenerator
zh_cn: 委派给子生成器的语法

source: Syntax for Variable Annotations
zh_cn: 变量注释的语法

source: The "bytes" Object
zh_cn: "bytes" 对象

source: The "python" Command on Unix-Like Systems
zh_cn: 类 Unix 系统上的 "python" 命令

source: The "with" Statement
zh_cn: "with" 语句

source: The Argument Clinic DSL
zh_cn: 参数诊所 DSL

source: The Locked Buffer Interface
zh_cn: 锁定的缓冲区接口

source: The Theory of Type Hints
zh_cn: 类型提示理论

source: The Wheel Binary Package Format 1.0
zh_cn: 轮子二进制包格式 1.0

source: The Wheel Binary Package Format 1.9
zh_cn: 轮子二进制包格式 1.9

source: The Zen of Python
zh_cn: Python 之禅

source: The enumerate() built-in function
zh_cn: enumerate() 内置函数

source: The pathlib module -- object-oriented filesystem paths
zh_cn: pathlib 模块 - 面向对象的文件系统路径

source: There should be one-- and preferably only one --obvious way to do it.
zh_cn: 应该有一种，且最好只有一种，显而易见的解决方法。

source: Things that will Not Change in Python 3000
zh_cn: Python 3000 中不会改变的东西

source: Time zone support improvements
zh_cn: 时区支持改进

source: Transitioning to release-file hosting on PyPI
zh_cn: 在 PyPI 上过渡到发布文件托管

source: Transitioning to the Py3K Standard Library
zh_cn: 转换到 Py3K 标准库

source: Treating Builtins as Constants in the Standard Library
zh_cn: 在标准库中处理 Builtin 作为常量

source: Type Hints
zh_cn: 类型提示

source: Type Names in the types Module
zh_cn: 在类型模块中输入名称

source: Underscores in Numeric Literals
zh_cn: 数字文字中的下划线

source: Unicode file name support for Windows NT
zh_cn: Unicode 文件名支持 Windows NT

source: Unifying Long Integers and Integers
zh_cn: 统一长整数和整数

source: Unifying try-except and try-finally
zh_cn: 统一 try-except 和 try-finally

source: Universal Newline Support
zh_cn: 通用换行支持

source: Unless explicitly silenced.
zh_cn: 除非它明确需要忽略。

source: Use decimal.Decimal type for timestamps
zh_cn: 对时间戳使用 decimal.Decimal 类型

source: Using Distutils to Build Python
zh_cn: 使用 Distutils 来构建 Python

source: Using UTF-8 as the default source encoding
zh_cn: 使用 UTF-8 作为默认的源码编码

source: Using site-packages on Windows
zh_cn: 在 Windows 上使用网站包

source: Using ssize_t as the index type
zh_cn: 使用 ssize_t 作为索引类型

source: Using the System RNG by default
zh_cn: 默认使用系统 RNG

source: Version Identification and Dependency Specification
zh_cn: 版本识别和依赖规范

source: Voting Guidelines
zh_cn: 投票指南

source: Warning Framework
zh_cn: 警告框架

source: Weak References
zh_cn: 弱引用

source: Web Library Enhancements
zh_cn: Web 库增强功能

source: argparse - New Command Line Parsing Module
zh_cn: argparse - 新的命令行解析模块

source: os.scandir() function -- a better and faster directory iterator
zh_cn: os.scandir() function -- 一个更好更快的目录迭代器

source: reStructuredText Docstring Format
zh_cn: reStructuredText 文档字符串格式

source: str(container) should call str(item), not repr(item)
zh_cn: str(container) 应该调用 str(item)，而不是 repr(item)

source: subprocess - New process module
zh_cn: subprocess - 新的进程模块

source: tzinfo implementations
zh_cn: tzinfo 实现

source: uniq method for list objects
zh_cn: 列表对象的 uniq 方法
